garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
    </edc:ConfigFuseSector>
    <edc:EEDataSector edc:beginaddr="0x380000" edc:endaddr="0x380100" edc:regionid="eedata"/>
    <edc:DIASector edc:beginaddr="0x2C0000" edc:endaddr="0x2C0040" edc:regionid="diamem">
      <edc:RegisterArray edc:cname="MUI" edc:_addr="0x2C0000">
        <edc:Register edc:cname="MUI0" edc:nzwidth="16" edc:_addr="0x2C0000"/>
        <edc:Register edc:cname="MUI1" edc:nzwidth="16" edc:_addr="0x2C0002"/>
        <edc:Register edc:cname="MUI2" edc:nzwidth="16" edc:_addr="0x2C0004"/>
        <edc:Register edc:cname="MUI3" edc:nzwidth="16" edc:_addr="0x2C0006"/>
        <edc:Register edc:cname="MUI4" edc:nzwidth="16" edc:_addr="0x2C0008"/>
        <edc:Register edc:cname="MUI5" edc:nzwidth="16" edc:_addr="0x2C000A"/>
        <edc:Register edc:cname="MUI6" edc:nzwidth="16" edc:_addr="0x2C000C"/>
        <edc:Register edc:cname="MUI7" edc:nzwidth="16" edc:_addr="0x2C000E"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="EUI" edc:_addr="0x2C0010">
        <edc:Register edc:cname="EUI0" edc:nzwidth="16" edc:_addr="0x2C0010"/>
        <edc:Register edc:cname="EUI1" edc:nzwidth="16" edc:_addr="0x2C0012"/>
        <edc:Register edc:cname="EUI2" edc:nzwidth="16" edc:_addr="0x2C0014"/>
        <edc:Register edc:cname="EUI3" edc:nzwidth="16" edc:_addr="0x2C0016"/>
        <edc:Register edc:cname="EUI4" edc:nzwidth="16" edc:_addr="0x2C0018"/>
        <edc:Register edc:cname="EUI5" edc:nzwidth="16" edc:_addr="0x2C001A"/>
        <edc:Register edc:cname="EUI6" edc:nzwidth="16" edc:_addr="0x2C001C"/>
        <edc:Register edc:cname="EUI7" edc:nzwidth="16" edc:_addr="0x2C001E"/>
        <edc:Register edc:cname="EUI8" edc:nzwidth="16" edc:_addr="0x2C0020"/>
        <edc:Register edc:cname="EUI9" edc:nzwidth="16" edc:_addr="0x2C0022"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="TSLR" edc:_addr="0x2C0024">
        <edc:Register edc:cname="TSLR1" edc:nzwidth="16" edc:_addr="0x2C0024"/>
        <edc:Register edc:cname="TSLR2" edc:nzwidth="16" edc:_addr="0x2C0026"/>
        <edc:Register edc:cname="TSLR3" edc:nzwidth="16" edc:_addr="0x2C0028"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="TSHR" edc:_addr="0x2C002A">
        <edc:Register edc:cname="TSHR1" edc:nzwidth="16" edc:_addr="0x2C002A"/>
        <edc:Register edc:cname="TSHR2" edc:nzwidth="16" edc:_addr="0x2C002C"/>
        <edc:Register edc:cname="TSHR3" edc:nzwidth="16" edc:_addr="0x2C002E"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="FVRA" edc:_addr="0x2C0030">
        <edc:Register edc:cname="FVRA1X" edc:nzwidth="16" edc:_addr="0x2C0030"/>
        <edc:Register edc:cname="FVRA2X" edc:nzwidth="16" edc:_addr="0x2C0032"/>
        <edc:Register edc:cname="FVRA4X" edc:nzwidth="16" edc:_addr="0x2C0034"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="FVRC" edc:_addr="0x2C0036">
        <edc:Register edc:cname="FVRC1X" edc:nzwidth="16" edc:_addr="0x2C0036"/>
        <edc:Register edc:cname="FVRC2X" edc:nzwidth="16" edc:_addr="0x2C0038"/>
        <edc:Register edc:cname="FVRC4X" edc:nzwidth="16" edc:_addr="0x2C003A"/>
      </edc:RegisterArray>
    </edc:DIASector>
    <edc:DCISector edc:beginaddr="0x3C0000" edc:endaddr="0x3C000A" edc:regionid="dcimem">
      <edc:Register edc:cname="ERSIZ" edc:nzwidth="16" edc:_addr="0x3C0000"/>
      <edc:Register edc:cname="WLSIZ" edc:nzwidth="16" edc:_addr="0x3C0002"/>
      <edc:Register edc:cname="URSIZ" edc:nzwidth="16" edc:_addr="0x3C0004"/>
      <edc:Register edc:cname="EESIZ" edc:nzwidth="16" edc:_addr="0x3C0006"/>
      <edc:Register edc:cname="PCNT" edc:nzwidth="16" edc:_addr="0x3C0008"/>
    </edc:DCISector>
    <edc:RevisionIDSector edc:beginaddr="0x3FFFFC" edc:endaddr="0x3FFFFE" edc:regionid="revid">
      <edc:DEVIDToRev edc:revlist="A0" edc:value="0x7AC0"/>
    </edc:RevisionIDSector>
    <edc:DeviceIDSector edc:beginaddr="0x3FFFFE" edc:endaddr="0x400000" edc:regionid="devid" edc:value="0x7AC0"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x0900">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:bank="0x0" edc:beginaddr="0x0000" edc:endaddr="0x0100" edc:regionid="sfr0">
        <edc:AdjustPoint edc:offset="0x38" edc:_addr="0x0"/>
        <edc:SFRDef edc:access="-------n" edc:cname="PRLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PRLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x38">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRLOCKED" edc:mask="0x1" edc:name="PRLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="MAINPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="MAINPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x39">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MAINPR" edc:mask="0x7" edc:name="MAINPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MAINPR0" edc:mask="0x1" edc:name="MAINPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAINPR1" edc:mask="0x1" edc:name="MAINPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAINPR2" edc:mask="0x1" edc:name="MAINPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ISRPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ISRPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x3A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ISRPR" edc:mask="0x7" edc:name="ISRPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ISRPR0" edc:mask="0x1" edc:name="ISRPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISRPR1" edc:mask="0x1" edc:name="ISRPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISRPR2" edc:mask="0x1" edc:name="ISRPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA1PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA1PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x3B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA1PR" edc:mask="0x7" edc:name="DMA1PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA1PR0" edc:mask="0x1" edc:name="DMA1PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1PR1" edc:mask="0x1" edc:name="DMA1PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1PR2" edc:mask="0x1" edc:name="DMA1PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA2PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA2PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x3C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA2PR" edc:mask="0x7" edc:name="DMA2PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA2PR0" edc:mask="0x1" edc:name="DMA2PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2PR1" edc:mask="0x1" edc:name="DMA2PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2PR2" edc:mask="0x1" edc:name="DMA2PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA3PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA3PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x3D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA3PR" edc:mask="0x7" edc:name="DMA3PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA3PR0" edc:mask="0x1" edc:name="DMA3PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3PR1" edc:mask="0x1" edc:name="DMA3PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3PR2" edc:mask="0x1" edc:name="DMA3PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA4PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA4PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x3E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA4PR" edc:mask="0x7" edc:name="DMA4PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA4PR0" edc:mask="0x1" edc:name="DMA4PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4PR1" edc:mask="0x1" edc:name="DMA4PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4PR2" edc:mask="0x1" edc:name="DMA4PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
