garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
        <edc:SFRDef edc:access="-------n" edc:cname="NVMCON0" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="NVMCON0" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x58">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="nDONE" edc:mask="0x1" edc:name="nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NVMGO" edc:mask="0x1" edc:name="NVMGO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="NVMCON1" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="NVMCON1" edc:nzwidth="8" edc:por="0----000" edc:_addr="0x59">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x7" edc:name="CMD" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NVMCMD" edc:mask="0x7" edc:name="NVMCMD" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMLOCK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMLOCK" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x5A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LOCK" edc:mask="0xff" edc:name="LOCK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NVMLOCK" edc:mask="0xff" edc:name="NVMLOCK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="NVMADR" edc:desc="" edc:name="NVMADR" edc:nzwidth="0x10" edc:_addr="0x5B">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="NVMADRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x5B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMADRL" edc:mask="0xff" edc:name="NVMADRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMADR0" edc:mask="0x1" edc:name="NVMADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR1" edc:mask="0x1" edc:name="NVMADR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR2" edc:mask="0x1" edc:name="NVMADR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR3" edc:mask="0x1" edc:name="NVMADR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR4" edc:mask="0x1" edc:name="NVMADR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR5" edc:mask="0x1" edc:name="NVMADR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR6" edc:mask="0x1" edc:name="NVMADR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR7" edc:mask="0x1" edc:name="NVMADR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="NVMADRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x5C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMADRH" edc:mask="0xff" edc:name="NVMADRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMADR8" edc:mask="0x1" edc:name="NVMADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR9" edc:mask="0x1" edc:name="NVMADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR10" edc:mask="0x1" edc:name="NVMADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR11" edc:mask="0x1" edc:name="NVMADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR12" edc:mask="0x1" edc:name="NVMADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR13" edc:mask="0x1" edc:name="NVMADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR14" edc:mask="0x1" edc:name="NVMADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR15" edc:mask="0x1" edc:name="NVMADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="NVMADRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="NVMADRU" edc:nzwidth="8" edc:por="--xxxxxx" edc:_addr="0x5D">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="NVMADRU" edc:mask="0x3f" edc:name="NVMADRU" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NVMADR16" edc:mask="0x1" edc:name="NVMADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR17" edc:mask="0x1" edc:name="NVMADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR18" edc:mask="0x1" edc:name="NVMADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR19" edc:mask="0x1" edc:name="NVMADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR20" edc:mask="0x1" edc:name="NVMADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="NVMADR21" edc:mask="0x1" edc:name="NVMADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
