garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1PID2" edc:desc="I3C PROVISIONAL ID REGISTER 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1PID2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID16" edc:mask="0x1" edc:name="PID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID17" edc:mask="0x1" edc:name="PID17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID18" edc:mask="0x1" edc:name="PID18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID19" edc:mask="0x1" edc:name="PID19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID20" edc:mask="0x1" edc:name="PID20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID21" edc:mask="0x1" edc:name="PID21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID22" edc:mask="0x1" edc:name="PID22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID23" edc:mask="0x1" edc:name="PID23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_23_16" edc:mask="0xff" edc:name="PID_23_16" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1PID3" edc:desc="I3C PROVISIONAL ID REGISTER 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1PID3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID24" edc:mask="0x1" edc:name="PID24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID25" edc:mask="0x1" edc:name="PID25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID26" edc:mask="0x1" edc:name="PID26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID27" edc:mask="0x1" edc:name="PID27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID28" edc:mask="0x1" edc:name="PID28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID29" edc:mask="0x1" edc:name="PID29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID30" edc:mask="0x1" edc:name="PID30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID31" edc:mask="0x1" edc:name="PID31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_31_24" edc:mask="0xff" edc:name="PID_31_24" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1PID4" edc:desc="I3C PROVISIONAL ID REGISTER 4" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1PID4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID32" edc:mask="0x1" edc:name="PID32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID33" edc:mask="0x1" edc:name="PID33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID34" edc:mask="0x1" edc:name="PID34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID35" edc:mask="0x1" edc:name="PID35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID36" edc:mask="0x1" edc:name="PID36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID37" edc:mask="0x1" edc:name="PID37" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID38" edc:mask="0x1" edc:name="PID38" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID39" edc:mask="0x1" edc:name="PID39" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PID_39_33" edc:mask="0x7f" edc:name="PID_39_33" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1PID5" edc:desc="I3C PROVISIONAL ID REGISTER 5" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1PID5" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID40" edc:mask="0x1" edc:name="PID40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID41" edc:mask="0x1" edc:name="PID41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID42" edc:mask="0x1" edc:name="PID42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID43" edc:mask="0x1" edc:name="PID43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID44" edc:mask="0x1" edc:name="PID44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID45" edc:mask="0x1" edc:name="PID45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID46" edc:mask="0x1" edc:name="PID46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID47" edc:mask="0x1" edc:name="PID47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_47_40" edc:mask="0xff" edc:name="PID_47_40" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrn" edc:cname="I3C1BCR" edc:desc="I3C BUS CHARACTERISTICS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00011110" edc:name="I3C1BCR" edc:nzwidth="8" edc:por="00011110" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BCR0" edc:mask="0x1" edc:name="BCR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCR1" edc:mask="0x1" edc:name="BCR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR2" edc:mask="0x1" edc:name="BCR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR3" edc:mask="0x1" edc:name="BCR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR4" edc:mask="0x1" edc:name="BCR4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR5" edc:mask="0x1" edc:name="BCR5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR6" edc:mask="0x1" edc:name="BCR6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR7" edc:mask="0x1" edc:name="BCR7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="BCR_7_6" edc:mask="0x3" edc:name="BCR_7_6" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
