garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MRTU" edc:desc="I3C MAXIMUM READ TURNAROUND UPPER BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MRTU" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB0">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRTU" edc:mask="0xff" edc:name="MRTU" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1RSTACT" edc:desc="I3C RSTACT CCC DEFINING BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I3C1RSTACT" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSTACT" edc:mask="0xff" edc:name="RSTACT" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I3C1BUSCXT" edc:desc="I3C BUS CONTEXT REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1BUSCXT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUSCXT" edc:mask="0xff" edc:name="BUSCXT" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I3C1CCC" edc:desc="I3C CCC RECEIVED REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1CCC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCC" edc:mask="0xff" edc:name="CCC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="I3C1I2CCON" edc:desc="I3C LEGACY I2C CONTROL REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="I3C1I2CCON" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDAHT" edc:mask="0x3" edc:name="SDAHT" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="FLTEN" edc:mask="0x1" edc:name="FLTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I3C1CLK" edc:desc="I3C CLOCK SELECTION REGISTER" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I3C1CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0xf" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2CON0" edc:desc="I3C CONTROL REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IBIREQ" edc:mask="0x1" edc:name="IBIREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HJREQ" edc:mask="0x1" edc:name="HJREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKP" edc:mask="0x1" edc:name="ACKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLRRXB" edc:mask="0x1" edc:name="CLRRXB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLRTXB" edc:mask="0x1" edc:name="CLRTXB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RST" edc:mask="0x1" edc:name="RST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOEN" edc:mask="0x1" edc:name="BTOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I3C2CON1" edc:desc="I3C CONTROL REGISTER 1" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I3C2CON1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACKPOS" edc:mask="0x1" edc:name="ACKPOS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SASDRMD" edc:mask="0x1" edc:name="SASDRMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FHDRE" edc:mask="0x1" edc:name="FHDRE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BERRDET" edc:mask="0x1" edc:name="BERRDET" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I3C2RXB" edc:desc="I3C RECEIVE BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2RXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xB8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
