garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MWLH" edc:desc="I3C MAXIMUM WRITE LENGTH HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MWLH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD1">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MWLH" edc:mask="0xff" edc:name="MWLH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="I3C2MRL" edc:desc="I3C MAXIMUM READ LENGTH" edc:name="I3C2MRL" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD2">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MRLL" edc:desc="I3C MAXIMUM READ LENGTH LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MRLL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD2">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRLL" edc:mask="0xff" edc:name="MRLL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MRLH" edc:desc="I3C MAXIMUM READ LENGTH HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MRLH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD3">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRLH" edc:mask="0xff" edc:name="MRLH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2IBIPSZ" edc:desc="I3C IN-BAND INTERRUPT PAYLOAD SIZE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2IBIPSZ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IBIPSZ" edc:mask="0xff" edc:name="IBIPSZ" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2PID0" edc:desc="I3C PROVISIONAL ID REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2PID0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID0" edc:mask="0x1" edc:name="PID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID1" edc:mask="0x1" edc:name="PID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID2" edc:mask="0x1" edc:name="PID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID3" edc:mask="0x1" edc:name="PID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID4" edc:mask="0x1" edc:name="PID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID5" edc:mask="0x1" edc:name="PID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID6" edc:mask="0x1" edc:name="PID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID7" edc:mask="0x1" edc:name="PID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_7_0" edc:mask="0xff" edc:name="PID_7_0" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2PID1" edc:desc="I3C PROVISIONAL ID REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2PID1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID8" edc:mask="0x1" edc:name="PID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID9" edc:mask="0x1" edc:name="PID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID10" edc:mask="0x1" edc:name="PID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID11" edc:mask="0x1" edc:name="PID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID12" edc:mask="0x1" edc:name="PID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID13" edc:mask="0x1" edc:name="PID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID14" edc:mask="0x1" edc:name="PID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID15" edc:mask="0x1" edc:name="PID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_11_8" edc:mask="0xf" edc:name="PID_11_8" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PID_15_12" edc:mask="0xf" edc:name="PID_15_12" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2PID2" edc:desc="I3C PROVISIONAL ID REGISTER 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2PID2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID16" edc:mask="0x1" edc:name="PID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID17" edc:mask="0x1" edc:name="PID17" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID18" edc:mask="0x1" edc:name="PID18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID19" edc:mask="0x1" edc:name="PID19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID20" edc:mask="0x1" edc:name="PID20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID21" edc:mask="0x1" edc:name="PID21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID22" edc:mask="0x1" edc:name="PID22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID23" edc:mask="0x1" edc:name="PID23" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_23_16" edc:mask="0xff" edc:name="PID_23_16" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2PID3" edc:desc="I3C PROVISIONAL ID REGISTER 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2PID3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID24" edc:mask="0x1" edc:name="PID24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID25" edc:mask="0x1" edc:name="PID25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID26" edc:mask="0x1" edc:name="PID26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID27" edc:mask="0x1" edc:name="PID27" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID28" edc:mask="0x1" edc:name="PID28" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID29" edc:mask="0x1" edc:name="PID29" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID30" edc:mask="0x1" edc:name="PID30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID31" edc:mask="0x1" edc:name="PID31" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_31_24" edc:mask="0xff" edc:name="PID_31_24" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2PID4" edc:desc="I3C PROVISIONAL ID REGISTER 4" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2PID4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xD9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID32" edc:mask="0x1" edc:name="PID32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID33" edc:mask="0x1" edc:name="PID33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID34" edc:mask="0x1" edc:name="PID34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID35" edc:mask="0x1" edc:name="PID35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID36" edc:mask="0x1" edc:name="PID36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID37" edc:mask="0x1" edc:name="PID37" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID38" edc:mask="0x1" edc:name="PID38" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID39" edc:mask="0x1" edc:name="PID39" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PID_39_33" edc:mask="0x7f" edc:name="PID_39_33" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2PID5" edc:desc="I3C PROVISIONAL ID REGISTER 5" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2PID5" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xDA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID40" edc:mask="0x1" edc:name="PID40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID41" edc:mask="0x1" edc:name="PID41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID42" edc:mask="0x1" edc:name="PID42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID43" edc:mask="0x1" edc:name="PID43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID44" edc:mask="0x1" edc:name="PID44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID45" edc:mask="0x1" edc:name="PID45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID46" edc:mask="0x1" edc:name="PID46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID47" edc:mask="0x1" edc:name="PID47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_47_40" edc:mask="0xff" edc:name="PID_47_40" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrn" edc:cname="I3C2BCR" edc:desc="I3C BUS CHARACTERISTICS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00011110" edc:name="I3C2BCR" edc:nzwidth="8" edc:por="00011110" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xDB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BCR0" edc:mask="0x1" edc:name="BCR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCR1" edc:mask="0x1" edc:name="BCR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR2" edc:mask="0x1" edc:name="BCR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR3" edc:mask="0x1" edc:name="BCR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR4" edc:mask="0x1" edc:name="BCR4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR5" edc:mask="0x1" edc:name="BCR5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR6" edc:mask="0x1" edc:name="BCR6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCR7" edc:mask="0x1" edc:name="BCR7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="BCR_7_6" edc:mask="0x3" edc:name="BCR_7_6" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2DCR" edc:desc="I3C DEVICE CHARACTERISTICS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11000110" edc:name="I3C2DCR" edc:nzwidth="8" edc:por="11000110" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xDC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DCR" edc:mask="0xff" edc:name="DCR" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnr-nnnn" edc:cname="I3C2DSTAT0" edc:desc="I3C DEVICE STATUS REGISTER 0" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="I3C2DSTAT0" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xDD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTPEND" edc:desc="Data/Address bit" edc:mask="0xf" edc:name="INTPEND" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PERR" edc:mask="0x1" edc:name="PERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTMODE" edc:mask="0x3" edc:name="ACTMODE" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INPEND0" edc:mask="0x1" edc:name="INPEND0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTPEND1" edc:mask="0x1" edc:name="INTPEND1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTPEND2" edc:mask="0x1" edc:name="INTPEND2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTPEND3" edc:mask="0x1" edc:name="INTPEND3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ACTMODE0" edc:mask="0x1" edc:name="ACTMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTMODE1" edc:mask="0x1" edc:name="ACTMODE1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2DSTAT1" edc:desc="I3C DEVICE STATUS REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2DSTAT1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xDE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VRSV" edc:mask="0xff" edc:name="VRSV" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VRSV0" edc:mask="0x1" edc:name="VRSV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV1" edc:mask="0x1" edc:name="VRSV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV2" edc:mask="0x1" edc:name="VRSV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV3" edc:mask="0x1" edc:name="VRSV3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV4" edc:mask="0x1" edc:name="VRSV4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV5" edc:mask="0x1" edc:name="VRSV5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV6" edc:mask="0x1" edc:name="VRSV6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VRSV7" edc:mask="0x1" edc:name="VRSV7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MWS" edc:desc="I3C MAXIMUM WRITE SPEED REGISTER" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MWS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xDF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MWS0" edc:mask="0x1" edc:name="MWS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MWS1" edc:mask="0x1" edc:name="MWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS2" edc:mask="0x1" edc:name="MWS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS3" edc:mask="0x1" edc:name="MWS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS4" edc:mask="0x1" edc:name="MWS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS5" edc:mask="0x1" edc:name="MWS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS6" edc:mask="0x1" edc:name="MWS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS7" edc:mask="0x1" edc:name="MWS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MWS_2_0" edc:mask="0x7" edc:name="MWS_2_0" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="MWS_7_4" edc:mask="0xf" edc:name="MWS_7_4" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MRS" edc:desc="I3C MAXIMUM READ SPEED REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MRS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MRS0" edc:mask="0x1" edc:name="MRS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MRS1" edc:mask="0x1" edc:name="MRS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS2" edc:mask="0x1" edc:name="MRS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS3" edc:mask="0x1" edc:name="MRS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS4" edc:mask="0x1" edc:name="MRS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS5" edc:mask="0x1" edc:name="MRS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS6" edc:mask="0x1" edc:name="MRS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MRS7" edc:mask="0x1" edc:name="MRS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MRS_2_0" edc:mask="0x7" edc:name="MRS_2_0" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="MRS_5_3" edc:mask="0x7" edc:name="MRS_5_3" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I3C2MRT" edc:desc="I3C MAXIMUM READ TURNAROUND TIME" edc:name="I3C2MRT" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE1">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MRTL" edc:desc="I3C MAXIMUM READ TURNAROUND LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MRTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE1">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRTL" edc:mask="0xff" edc:name="MRTL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MRTH" edc:desc="I3C MAXIMUM READ TURNAROUND HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MRTH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE2">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRTH" edc:mask="0xff" edc:name="MRTH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2MRTU" edc:desc="I3C MAXIMUM READ TURNAROUND UPPER BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2MRTU" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE3">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRTU" edc:mask="0xff" edc:name="MRTU" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C2RSTACT" edc:desc="I3C RSTACT CCC DEFINING BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I3C2RSTACT" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSTACT" edc:mask="0xff" edc:name="RSTACT" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I3C2BUSCXT" edc:desc="I3C BUS CONTEXT REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2BUSCXT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUSCXT" edc:mask="0xff" edc:name="BUSCXT" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
