garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I3C2CCC" edc:desc="I3C CCC RECEIVED REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C2CCC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCC" edc:mask="0xff" edc:name="CCC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="I3C2I2CCON" edc:desc="I3C LEGACY I2C CONTROL REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="I3C2I2CCON" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDAHT" edc:mask="0x3" edc:name="SDAHT" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="FLTEN" edc:mask="0x1" edc:name="FLTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I3C2CLK" edc:desc="I3C CLOCK SELECTION REGISTER" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I3C2CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xE8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0xf" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x1" edc:beginaddr="0x0100" edc:endaddr="0x0200" edc:regionid="sfr1">
        <edc:SFRDef edc:access="n--nnnnn" edc:cname="CLKRCON" edc:desc="" edc:impl="0x9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--10000" edc:name="CLKRCON" edc:nzwidth="8" edc:por="0--10000" edc:_modsrc="DOS-02548_clk_refout_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DIV" edc:mask="0x7" edc:name="DIV" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DC" edc:mask="0x3" edc:name="DC" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV0" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV1" edc:mask="0x1" edc:name="CLKRDIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV2" edc:mask="0x1" edc:name="CLKRDIV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC0" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC1" edc:mask="0x1" edc:name="CLKRDC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CLKREN" edc:desc="" edc:mask="0x1" edc:name="CLKREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DIV0" edc:mask="0x1" edc:name="DIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIV1" edc:mask="0x1" edc:name="DIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIV2" edc:mask="0x1" edc:name="DIV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC0" edc:mask="0x1" edc:name="DC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC1" edc:mask="0x1" edc:name="DC1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CLKRCLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CLKRCLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02548_clk_refout_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x101">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:desc="" edc:mask="0xf" edc:name="CLK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRCLK0" edc:mask="0x1" edc:name="CLKRCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK1" edc:mask="0x1" edc:name="CLKRCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK2" edc:mask="0x1" edc:name="CLKRCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK3" edc:mask="0x1" edc:name="CLKRCLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x102"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR0L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x103">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0L" edc:desc="" edc:mask="0xff" edc:name="TMR0L" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR0L0" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L1" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L2" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L3" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L4" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L5" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L6" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0L7" edc:mask="0x1" edc:name="TMR0L0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TMR0H" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x104">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0H" edc:mask="0xff" edc:name="TMR0H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR0H0" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H1" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H2" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H3" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H4" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H5" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H6" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0H7" edc:mask="0x1" edc:name="TMR0H0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0PR0" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR1" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR2" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR3" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR4" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR5" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR6" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0PR7" edc:mask="0x1" edc:name="T0PR0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T0PR" edc:mask="0xff" edc:name="T0PR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="T0CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="T0CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x105">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="MD16" edc:desc="" edc:mask="0x1" edc:name="MD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0OUTPS" edc:mask="0xf" edc:name="T0OUTPS" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="T0MD16" edc:mask="0x1" edc:name="T0MD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUT" edc:mask="0x1" edc:name="T0OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T0EN" edc:mask="0x1" edc:name="T0EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T016BIT" edc:mask="0x1" edc:name="T016BIT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T0OUTPS0" edc:mask="0x1" edc:name="T0OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS1" edc:mask="0x1" edc:name="T0OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS2" edc:mask="0x1" edc:name="T0OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS3" edc:mask="0x1" edc:name="T0OUTPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T0CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T0CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x106">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0xf" edc:name="CKPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="ASYNC" edc:desc="" edc:mask="0x1" edc:name="ASYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x7" edc:name="CS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS3" edc:mask="0x1" edc:name="CKPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0ASYNC" edc:mask="0x1" edc:name="T0ASYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0CKPS" edc:mask="0xf" edc:name="T0CKPS" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:mask="0x7" edc:name="T0CS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T0CKPS0" edc:mask="0x1" edc:name="T0CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS1" edc:mask="0x1" edc:name="T0CKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS2" edc:mask="0x1" edc:name="T0CKPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS3" edc:mask="0x1" edc:name="T0CKPS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS0" edc:mask="0x1" edc:name="T0CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS1" edc:mask="0x1" edc:name="T0CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS2" edc:mask="0x1" edc:name="T0CS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR1" edc:desc="Joined 16-bit Timer" edc:name="TMR1" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x107"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x107">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1L" edc:mask="0xff" edc:name="TMR1L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1L0" edc:mask="0x1" edc:name="TMR1L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L1" edc:mask="0x1" edc:name="TMR1L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L2" edc:mask="0x1" edc:name="TMR1L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L3" edc:mask="0x1" edc:name="TMR1L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L4" edc:mask="0x1" edc:name="TMR1L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L5" edc:mask="0x1" edc:name="TMR1L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L6" edc:mask="0x1" edc:name="TMR1L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L7" edc:mask="0x1" edc:name="TMR1L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR10" edc:mask="0x1" edc:name="TMR10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR11" edc:mask="0x1" edc:name="TMR11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR12" edc:mask="0x1" edc:name="TMR12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR13" edc:mask="0x1" edc:name="TMR13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR14" edc:mask="0x1" edc:name="TMR14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR15" edc:mask="0x1" edc:name="TMR15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR16" edc:mask="0x1" edc:name="TMR16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR17" edc:mask="0x1" edc:name="TMR17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
