garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x13F">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BTMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BTMRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x13F">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRH" edc:desc="" edc:mask="0xff" edc:name="TMRH" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRH0" edc:mask="0x1" edc:name="TMRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH1" edc:mask="0x1" edc:name="TMRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH2" edc:mask="0x1" edc:name="TMRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH3" edc:mask="0x1" edc:name="TMRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH4" edc:mask="0x1" edc:name="TMRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH5" edc:mask="0x1" edc:name="TMRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH6" edc:mask="0x1" edc:name="TMRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH7" edc:mask="0x1" edc:name="TMRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BTMRH0" edc:mask="0x1" edc:name="TU16BTMRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH1" edc:mask="0x1" edc:name="TU16BTMRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH2" edc:mask="0x1" edc:name="TU16BTMRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH3" edc:mask="0x1" edc:name="TU16BTMRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH4" edc:mask="0x1" edc:name="TU16BTMRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH5" edc:mask="0x1" edc:name="TU16BTMRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH6" edc:mask="0x1" edc:name="TU16BTMRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH7" edc:mask="0x1" edc:name="TU16BTMRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BTMR8" edc:mask="0x1" edc:name="TU16BTMR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR9" edc:mask="0x1" edc:name="TU16BTMR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR10" edc:mask="0x1" edc:name="TU16BTMR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR11" edc:mask="0x1" edc:name="TU16BTMR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR12" edc:mask="0x1" edc:name="TU16BTMR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR13" edc:mask="0x1" edc:name="TU16BTMR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR14" edc:mask="0x1" edc:name="TU16BTMR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR15" edc:mask="0x1" edc:name="TU16BTMR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16BCRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x13F">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRH" edc:desc="" edc:mask="0xff" edc:name="CRH" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRH0" edc:mask="0x1" edc:name="CRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH1" edc:mask="0x1" edc:name="CRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH2" edc:mask="0x1" edc:name="CRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH3" edc:mask="0x1" edc:name="CRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH4" edc:mask="0x1" edc:name="CRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH5" edc:mask="0x1" edc:name="CRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH6" edc:mask="0x1" edc:name="CRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH7" edc:mask="0x1" edc:name="CRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BCRH0" edc:mask="0x1" edc:name="TU16BCRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH1" edc:mask="0x1" edc:name="TU16BCRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH2" edc:mask="0x1" edc:name="TU16BCRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH3" edc:mask="0x1" edc:name="TU16BCRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH4" edc:mask="0x1" edc:name="TU16BCRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH5" edc:mask="0x1" edc:name="TU16BCRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH6" edc:mask="0x1" edc:name="TU16BCRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH7" edc:mask="0x1" edc:name="TU16BCRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BCR8" edc:mask="0x1" edc:name="TU16BCR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR9" edc:mask="0x1" edc:name="TU16BCR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR10" edc:mask="0x1" edc:name="TU16BCR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR11" edc:mask="0x1" edc:name="TU16BCR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR12" edc:mask="0x1" edc:name="TU16BCR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR13" edc:mask="0x1" edc:name="TU16BCR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR14" edc:mask="0x1" edc:name="TU16BCR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR15" edc:mask="0x1" edc:name="TU16BCR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x140"/>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x141">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BTMRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BTMRT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x141">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRT" edc:mask="0xff" edc:name="TMRT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRT0" edc:mask="0x1" edc:name="TMRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT1" edc:mask="0x1" edc:name="TMRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT2" edc:mask="0x1" edc:name="TMRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT3" edc:mask="0x1" edc:name="TMRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT4" edc:mask="0x1" edc:name="TMRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT5" edc:mask="0x1" edc:name="TMRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT6" edc:mask="0x1" edc:name="TMRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRT7" edc:mask="0x1" edc:name="TMRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BTMRT0" edc:mask="0x1" edc:name="TU16BTMRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT1" edc:mask="0x1" edc:name="TU16BTMRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT2" edc:mask="0x1" edc:name="TU16BTMRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT3" edc:mask="0x1" edc:name="TU16BTMRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT4" edc:mask="0x1" edc:name="TU16BTMRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT5" edc:mask="0x1" edc:name="TU16BTMRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT6" edc:mask="0x1" edc:name="TU16BTMRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRT7" edc:mask="0x1" edc:name="TU16BTMRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BTMR24" edc:mask="0x1" edc:name="TU16BTMR24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR25" edc:mask="0x1" edc:name="TU16BTMR25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR26" edc:mask="0x1" edc:name="TU16BTMR26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR27" edc:mask="0x1" edc:name="TU16BTMR27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR28" edc:mask="0x1" edc:name="TU16BTMR28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR29" edc:mask="0x1" edc:name="TU16BTMR29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR30" edc:mask="0x1" edc:name="TU16BTMR30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR31" edc:mask="0x1" edc:name="TU16BTMR31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16BCRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCRT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x141">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRT" edc:mask="0xff" edc:name="CRT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRT0" edc:mask="0x1" edc:name="CRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT1" edc:mask="0x1" edc:name="CRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT2" edc:mask="0x1" edc:name="CRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT3" edc:mask="0x1" edc:name="CRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT4" edc:mask="0x1" edc:name="CRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT5" edc:mask="0x1" edc:name="CRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT6" edc:mask="0x1" edc:name="CRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRT7" edc:mask="0x1" edc:name="CRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BCRT0" edc:mask="0x1" edc:name="TU16BCRT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT1" edc:mask="0x1" edc:name="TU16BCRT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT2" edc:mask="0x1" edc:name="TU16BCRT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT3" edc:mask="0x1" edc:name="TU16BCRT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT4" edc:mask="0x1" edc:name="TU16BCRT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT5" edc:mask="0x1" edc:name="TU16BCRT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT6" edc:mask="0x1" edc:name="TU16BCRT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRT7" edc:mask="0x1" edc:name="TU16BCRT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BCR24" edc:mask="0x1" edc:name="TU16BCR24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR25" edc:mask="0x1" edc:name="TU16BCR25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR26" edc:mask="0x1" edc:name="TU16BCR26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR27" edc:mask="0x1" edc:name="TU16BCR27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR28" edc:mask="0x1" edc:name="TU16BCR28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR29" edc:mask="0x1" edc:name="TU16BCR29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR30" edc:mask="0x1" edc:name="TU16BCR30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR31" edc:mask="0x1" edc:name="TU16BCR31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="TU16BPR" edc:desc="" edc:name="TU16BPR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x142">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x142">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRL" edc:mask="0xff" edc:name="PRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRL0" edc:mask="0x1" edc:name="PRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL1" edc:mask="0x1" edc:name="PRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL2" edc:mask="0x1" edc:name="PRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL3" edc:mask="0x1" edc:name="PRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL4" edc:mask="0x1" edc:name="PRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL5" edc:mask="0x1" edc:name="PRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL6" edc:mask="0x1" edc:name="PRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL7" edc:mask="0x1" edc:name="PRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16BPRL0" edc:mask="0x1" edc:name="TU16BPRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL1" edc:mask="0x1" edc:name="TU16BPRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL2" edc:mask="0x1" edc:name="TU16BPRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL3" edc:mask="0x1" edc:name="TU16BPRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL4" edc:mask="0x1" edc:name="TU16BPRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL5" edc:mask="0x1" edc:name="TU16BPRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL6" edc:mask="0x1" edc:name="TU16BPRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL7" edc:mask="0x1" edc:name="TU16BPRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16BPR0" edc:mask="0x1" edc:name="TU16BPR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR1" edc:mask="0x1" edc:name="TU16BPR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR2" edc:mask="0x1" edc:name="TU16BPR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR3" edc:mask="0x1" edc:name="TU16BPR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR4" edc:mask="0x1" edc:name="TU16BPR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR5" edc:mask="0x1" edc:name="TU16BPR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR6" edc:mask="0x1" edc:name="TU16BPR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR7" edc:mask="0x1" edc:name="TU16BPR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x143">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRH" edc:mask="0xff" edc:name="PRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRH0" edc:mask="0x1" edc:name="PRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH1" edc:mask="0x1" edc:name="PRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH2" edc:mask="0x1" edc:name="PRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH3" edc:mask="0x1" edc:name="PRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH4" edc:mask="0x1" edc:name="PRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH5" edc:mask="0x1" edc:name="PRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH6" edc:mask="0x1" edc:name="PRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH7" edc:mask="0x1" edc:name="PRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16BPRH0" edc:mask="0x1" edc:name="TU16BPRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH1" edc:mask="0x1" edc:name="TU16BPRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH2" edc:mask="0x1" edc:name="TU16BPRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH3" edc:mask="0x1" edc:name="TU16BPRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH4" edc:mask="0x1" edc:name="TU16BPRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH5" edc:mask="0x1" edc:name="TU16BPRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH6" edc:mask="0x1" edc:name="TU16BPRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH7" edc:mask="0x1" edc:name="TU16BPRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16BPR8" edc:mask="0x1" edc:name="TU16BPR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR9" edc:mask="0x1" edc:name="TU16BPR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR10" edc:mask="0x1" edc:name="TU16BPR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR11" edc:mask="0x1" edc:name="TU16BPR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR12" edc:mask="0x1" edc:name="TU16BPR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR13" edc:mask="0x1" edc:name="TU16BPR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR14" edc:mask="0x1" edc:name="TU16BPR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR15" edc:mask="0x1" edc:name="TU16BPR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
