garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="ADRESH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x227">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RES" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="RES" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADRES8" edc:mask="0x1" edc:name="ADRES8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES9" edc:mask="0x1" edc:name="ADRES9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES10" edc:mask="0x1" edc:name="ADRES10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES11" edc:mask="0x1" edc:name="ADRES11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES12" edc:mask="0x1" edc:name="ADRES12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES13" edc:mask="0x1" edc:name="ADRES13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES14" edc:mask="0x1" edc:name="ADRES14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES15" edc:mask="0x1" edc:name="ADRES15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADRES" edc:mask="0xff" edc:name="ADRES" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="RES8" edc:mask="0x1" edc:name="RES8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES9" edc:mask="0x1" edc:name="RES9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES10" edc:mask="0x1" edc:name="RES10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES11" edc:mask="0x1" edc:name="RES11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES12" edc:mask="0x1" edc:name="RES12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES13" edc:mask="0x1" edc:name="RES13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES14" edc:mask="0x1" edc:name="RES14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES15" edc:mask="0x1" edc:name="RES15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADPCH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADPCH" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x228">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0x3f" edc:name="PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPCH0" edc:desc="" edc:mask="0x1" edc:name="ADPCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH1" edc:desc="" edc:mask="0x1" edc:name="ADPCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH2" edc:desc="" edc:mask="0x1" edc:name="ADPCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH3" edc:desc="" edc:mask="0x1" edc:name="ADPCH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH4" edc:desc="" edc:mask="0x1" edc:name="ADPCH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH5" edc:desc="" edc:mask="0x1" edc:name="ADPCH5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADNCH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADNCH" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x229">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0x3f" edc:name="NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADNCH0" edc:mask="0x1" edc:name="ADNCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADNCH1" edc:mask="0x1" edc:name="ADNCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADNCH2" edc:mask="0x1" edc:name="ADNCH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADNCH3" edc:mask="0x1" edc:name="ADNCH3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADNCH4" edc:mask="0x1" edc:name="ADNCH4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADNCH5" edc:mask="0x1" edc:name="ADNCH5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ADACQ" edc:desc="" edc:name="ADACQ" edc:nzwidth="0x10" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x22A">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADACQL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADACQL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x22A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACQ" edc:mask="0xff" edc:name="ACQ" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADACQ0" edc:mask="0x1" edc:name="ADACQ0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ1" edc:mask="0x1" edc:name="ADACQ1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ2" edc:mask="0x1" edc:name="ADACQ2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ3" edc:mask="0x1" edc:name="ADACQ3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ4" edc:mask="0x1" edc:name="ADACQ4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ5" edc:mask="0x1" edc:name="ADACQ5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ6" edc:mask="0x1" edc:name="ADACQ6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ7" edc:mask="0x1" edc:name="ADACQ7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADACQ" edc:mask="0xff" edc:name="ADACQ" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ACQ0" edc:mask="0x1" edc:name="ACQ0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ1" edc:mask="0x1" edc:name="ACQ1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ2" edc:mask="0x1" edc:name="ACQ2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ3" edc:mask="0x1" edc:name="ACQ3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ4" edc:mask="0x1" edc:name="ACQ4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ5" edc:mask="0x1" edc:name="ACQ5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ6" edc:mask="0x1" edc:name="ACQ6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ7" edc:mask="0x1" edc:name="ACQ7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="ADACQH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="ADACQH" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x22B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACQ" edc:mask="0x1f" edc:name="ACQ" edc:nzwidth="0x5"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADACQ8" edc:mask="0x1" edc:name="ADACQ8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ9" edc:mask="0x1" edc:name="ADACQ9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ10" edc:mask="0x1" edc:name="ADACQ10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ11" edc:mask="0x1" edc:name="ADACQ11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ12" edc:mask="0x1" edc:name="ADACQ12" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADACQ" edc:mask="0x1f" edc:name="ADACQ" edc:nzwidth="0x5"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ACQ8" edc:mask="0x1" edc:name="ACQ8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ9" edc:mask="0x1" edc:name="ACQ9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ10" edc:mask="0x1" edc:name="ACQ10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ11" edc:mask="0x1" edc:name="ACQ11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ12" edc:mask="0x1" edc:name="ACQ12" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADCAP" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="ADCAP" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x28" edc:_addr="0x22C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP" edc:mask="0x1f" edc:name="CAP" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCAP0" edc:desc="" edc:mask="0x1" edc:name="ADCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP1" edc:desc="" edc:mask="0x1" edc:name="ADCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP2" edc:desc="" edc:mask="0x1" edc:name="ADCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP3" edc:desc="" edc:mask="0x1" edc:name="ADCAP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP4" edc:desc="" edc:mask="0x1" edc:name="ADCAP4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
