garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PWMIN0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="PWMIN0PPS" edc:nzwidth="8" edc:por="---10101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x384">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWMIN0PPS" edc:mask="0x1f" edc:name="PWMIN0PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWMIN0PPS0" edc:mask="0x1" edc:name="PWMIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS1" edc:mask="0x1" edc:name="PWMIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS2" edc:mask="0x1" edc:name="PWMIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS3" edc:mask="0x1" edc:name="PWMIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN0PPS4" edc:mask="0x1" edc:name="PWMIN0PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PWMIN1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="PWMIN1PPS" edc:nzwidth="8" edc:por="---10011" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x385">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWMIN1PPS" edc:mask="0x1f" edc:name="PWMIN1PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWMIN1PPS0" edc:mask="0x1" edc:name="PWMIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS1" edc:mask="0x1" edc:name="PWMIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS2" edc:mask="0x1" edc:name="PWMIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS3" edc:mask="0x1" edc:name="PWMIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMIN1PPS4" edc:mask="0x1" edc:name="PWMIN1PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PWM1ERSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="PWM1ERSPPS" edc:nzwidth="8" edc:por="---00101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x386">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS" edc:mask="0x1f" edc:name="PWM1ERSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS0" edc:mask="0x1" edc:name="PWM1ERSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS1" edc:mask="0x1" edc:name="PWM1ERSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS2" edc:mask="0x1" edc:name="PWM1ERSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS3" edc:mask="0x1" edc:name="PWM1ERSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1ERSPPS4" edc:mask="0x1" edc:name="PWM1ERSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PWM2ERSPPS" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-uuuuu" edc:name="PWM2ERSPPS" edc:nzwidth="8" edc:por="---10001" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x387">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS" edc:mask="0x1f" edc:name="PWM2ERSPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS0" edc:mask="0x1" edc:name="PWM2ERSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS1" edc:mask="0x1" edc:name="PWM2ERSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS2" edc:mask="0x1" edc:name="PWM2ERSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS3" edc:mask="0x1" edc:name="PWM2ERSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2ERSPPS4" edc:mask="0x1" edc:name="PWM2ERSPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x11" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x388"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CWG1PPS" edc:nzwidth="8" edc:por="---00010" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x399">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1INPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWG1INPPS" edc:mask="0x1f" edc:name="CWG1INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1INPPS0" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS1" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS2" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS3" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS4" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CWGINPPS" edc:mask="0x1f" edc:name="CWGINPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
