garyPenhook/PIC-Assembler/edc/PIC18F14Q20.PIC
        <edc:SFRDef edc:access="nnn-----" edc:cname="INLVLB" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="111-----" edc:name="INLVLB" edc:nzwidth="8" edc:por="111-----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x424">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB5" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB6" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB7" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="IOCBP" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="IOCBP" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x425">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="IOCBN" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="IOCBN" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x426">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="IOCBF" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="IOCBF" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x427">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x428"/>
        <edc:SFRDef edc:access="nnnnn---" edc:cname="ANSELC" edc:desc="" edc:impl="0xf8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111---" edc:name="ANSELC" edc:nzwidth="8" edc:por="11111---" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSELC3" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC4" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC5" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC6" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC7" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="WPUC" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="WPUC" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUC0" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC1" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WPUC3" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC4" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC5" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC6" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC7" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
